//
//  Model.swift
//  寻色
//
//  Created by Mengduan on 2024/3/11.
//

import UIKit
//转换主题色
var isWhiteColor = true

struct mainColor {
    let black : UIColor = .black
    let white : UIColor = .white
}
struct RGB {
    var r : Float = 0.0
    var g : Float = 0.0
    var b : Float = 0.0
    var alphe : Float = 0.0
}

var textColor : UIColor = .white

var chatTexts : [String] = ["hello,you can ask me about some health concerns."]
/// 时间类型RowValue
enum TimeFormat:String {
    case YYYYMMDD = "YYYY-MM-dd"
    case YYYYMMDDHH = "YYYY-MM-dd HH"
    case YYYYMMDDHHMM = "YYYY-MM-dd HH:mm"
    case YYYYMMDDHHMMSS = "YYYY-MM-dd HH:mm:ss"
    case YYYYMMDDHHMMSSsss = "YYYY-MM-dd HH:mm:ss.SSS"
}


struct colorsModel {
    let red = redModel
    let blue = blueModel
    let green = greenModel
    let yellow = yellowModel
    let black = blackModel
    let white = whiteModel
    let brown = brownModel
}


let redModel : [String] = [
    "红色",
    ".red",
    " ———— RGB：(255,0,0)",
    "象征着爱情、激情、勇气和力量。也常与危险联系。",
    "No1.庆祝与节日：",
    "在许多文化中被用于庆祝和节日装饰。",
    "No2.警示与危险：",
    "用于提醒人们注意危险或采取行动。",
    "No3.品牌与营销：",
    "用于吸引消费者的注意力。",
    "No4.服装与时尚：",
    "常被视为一种大胆而优雅的选择。",
    "No5.室内设计：",
    "可以创造温暖、充满活力的空间氛围。",
    "No6.艺术与文化：",
    "用来表达情感的深度和强度。",
    "No7.交通信号：",
    "在交通信号灯中，红色代表停止。",
    "No8.自然界：",
    "增添自然界的色彩、有特定的生物学意义。"]
let blueModel : [String] = [
    "蓝色",
    ".blue",
    " ———— RGB：(0,0,255)",
    "常常被关联于宁静、智慧、信任和稳定",
    "No1.科技与创新：",
    "象征创新、专业和高科技。",
    "No2.心理效应：",
    "给人一种心平气和的感觉。",
    "No3.品牌与营销：",
    "用于吸引消费者的注意力。",
    "No4.服装与时尚：",
    "淡蓝墙面可以让空间显得更加宽敞和舒适。",
    "No5.宗教与信仰：",
    "象征着知识、清洁和精神上的启迪。",
    "No6.艺术与文化：",
    "被用来表达一种深沉的情感和内省的情绪。",
    "No7.交通信号：",
    "蓝色在交通标志中用来提供信息或指示。",
    "No8.自然界：",
    "最明显的是广阔的天空和深邃的海洋。"]
let greenModel : [String] = [
    "绿色",
    ".green",
    " ———— RGB：(0,255,0)",
    "常与自然、生长和和平相关联",
    "No1.自然与环境：",
    "象征着生命和成长，绿色的环境能够减轻压力。",
    "No2.健康与营养：",
    "绿色食物通常富含营养，对健康极为有益。",
    "No3.平静与放松：",
    "有助于缓解眼睛疲劳和减少压力。",
    "No4.象征意义：",
    "在许多文化中，绿色象征着希望、和平和复兴。",
    "No5.时尚与设计：",
    "能带来生命感和活力，可以适应各种风格和场合。",
    "No6.可持续性与环保：",
    "经常与环保和可持续生活方式联系在一起。",
    "No7.文学与艺术：",
    "绿色被用来传达多种情感和概念。",
    "No8.信仰与宗教：",
    "在伊斯兰教中，绿色象征着幸福和和平。"]
let yellowModel : [String] = [
    "黄色",
    ".yellow",
    " ———— RGB：(255,255,0)",
    "常与快乐、活力和警示相关联",
    "No1.警示与安全：",
    "黄色常用于警告标志和安全设备。",
    "No2.交通：",
    "黄色代表着减速或即将变红的信号。",
    "No3.品牌与营销：",
    "用于吸引顾客的注意并传递活泼的品牌形象。",
    "No4.服装与时尚：",
    "黄色服饰能够让人看起来更加明亮和活力四射。",
    "No5.室内设计：",
    "在室内设计中用来创造温馨、舒适的氛围。",
    "No6.文化和艺术：",
    "黄色常用来表达快乐和希望的情绪。",
    "No7.食物：",
    "黄色食物，不仅色彩诱人，也象征着健康和活力。",
"",""]
let blackModel : [String] = [
    "黑色",
    ".black",
    " ———— RGB：(0,0,0)",
    "通常与权力、优雅和神秘相关联",
    "No1.权威与优雅：",
    "经常与权力、优雅、正式和高度的专业性相关联。",
    "No2.悲伤与哀悼：",
    "黑色是哀悼和悲伤的颜色。",
    "No3.神秘与未知：",
    "黑色常被用来象征神秘、未知和无限。",
    "No4.力量与反叛：",
    "黑色常常与力量、决断和反叛精神相联系。",
    "No5.简约与现代：",
    "黑色是极简主义设计和现代艺术中的常见颜色。",
    "No6.恐惧与邪恶：",
    "黑色经常与恐惧、邪恶、死亡和不详预兆相联系。",
    "No7.隐私与保护：",
    "黑色可以隐藏身份或遮掩特定的特征。",
    "No8.无限与深邃：",
    "在艺术和设计中，黑色可以创造一种深邃感。"]
let whiteModel : [String] = [
    "白色",
    ".white",
    " ———— RGB：(255,255,255)",
    "通常与纯净、和平和简约相关联",
    "No1.纯洁和无瑕：",
    "白色常被用来象征纯洁和无瑕。",
    "No2.和平与和谐：",
    "白色旗帜经常被用作和平的象征。",
    "No3.简洁与现代：",
    "白色能够营造出宽敞、清新和明亮的空间感觉。",
    "No4.纯粹与真理：",
    "白色经常被视为纯粹和真理的象征。",
    "No5.无限和开放：",
    "白色能够扩大空间感。",
    "No6.冷静和中性：",
    "白色可以平衡其他更强烈的颜色。",
    "No7.无形与空白：",
    "白色可以代表无形或空白。",
    "No8.隐喻和象征：",
    "白色常用来象征隐喻和深层含义。"]

let brownModel : [String] = [
    "棕色",
    ".brown",
    " ———— RGB：(165,42,42)",
    "常给人以安全感、可靠性和舒适",
    "No1.自然与土地：",
    "棕色常被认为是大自然的颜色。",
    "No2.稳定与安全：",
    "棕色象征着稳定性、结实和可靠性。",
    "No3.舒适与温馨：",
    "棕色常用于创造温馨和舒适的居家环境。",
    "No4.传统与手工艺：",
    "棕色与传统手工艺和质朴的美学紧密相关。",
    "No5.实用性与耐用性：",
    "棕色在设计中被视为实用和耐用的颜色。",
    "No6.营养与丰富：",
    "棕色常与可口、营养丰富的食品相关联。",
    "No7.多样性与包容性：",
    "棕色代表着人类肤色的广泛范围。",
    "No8.沉稳与深思：",
    "棕色还与内省沉稳和深思熟虑的品质相关。"
]
